{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello, thanks for visiting",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "internship_application",
      "patterns": [
        "How can I apply for an internship?",
        "What is the application process for interns?",
        "Where do I submit my internship application?"
      ],
      "responses": [
        "You can apply for an internship on our careers page.",
        "Submit your application through our online portal.",
        "Visit our website and check the internship openings."
      ]
    },
    {
      "tag": "internship_requirements",
      "patterns": [
        "What are the requirements for the internship?",
        "Do I need experience to apply for an internship?",
        "What qualifications do I need for an internship?"
      ],
      "responses": [
        "We welcome students and recent graduates with a passion for learning.",
        "No prior experience is required, but relevant skills are a plus.",
        "Basic knowledge in the field and a willingness to learn are required."
      ]
    },
    {
      "tag": "internship_duration",
      "patterns": [
        "How long does the internship last?",
        "What is the duration of the internship?",
        "Is the internship full-time or part-time?"
      ],
      "responses": [
        "Our internship program lasts between 6 to 12 months.",
        "Internship duration varies, typically from 3 to 6 months.",
        "We offer both part-time and full-time internship opportunities."
      ]
    },
    {
      "tag": "internship_stipend",
      "patterns": [
        "Is the internship paid?",
        "Do interns receive a stipend?",
        "Will I be paid during my internship?"
      ],
      "responses": [
        "Yes, we provide a stipend based on the role and duration.",
        "Some internships are paid, while others offer valuable experience.",
        "Stipend details will be discussed during the interview."
      ]
    },
    {
      "tag": "internship_roles",
      "patterns": [
        "What roles are available for interns?",
        "What kind of work do interns do?",
        "What positions are open for interns?"
      ],
      "responses": [
        "We offer internships in software development, marketing, and data analysis.",
        "Interns work on real projects and collaborate with experienced professionals.",
        "Available roles depend on our current company needs."
      ]
    },
    {
      "tag": "internship_benefits",
      "patterns": [
        "What are the benefits of an internship?",
        "What will I gain from this internship?",
        "How does this internship help my career?"
      ],
      "responses": [
        "You will gain hands-on experience and networking opportunities.",
        "Interns develop industry-relevant skills and get mentorship from experts.",
        "Our internship program enhances your resume and career prospects."
      ]
    },
    {
      "tag": "internship_interview",
      "patterns": [
        "What questions are asked in an internship interview?",
        "How can I prepare for my internship interview?",
        "What should I expect in the interview?"
      ],
      "responses": [
        "Be prepared to discuss your skills, experiences, and career goals.",
        "Common questions include 'Tell us about yourself' and 'Why do you want this internship?'",
        "Technical and behavioral questions may be asked based on the role."
      ]
    },
    {
      "tag": "internship_hiring_decision",
      "patterns": [
        "How long does it take to get hired as an intern?",
        "When will I know if I got the internship?",
        "What is the selection process for interns?"
      ],
      "responses": [
        "The hiring process usually takes 1-2 weeks.",
        "We will notify you within a few days after the interview.",
        "Selections are based on interviews and skill assessments."
      ]
    }
  ]
}
